code-review/NRB_3471_3546/База_Было/Documents/ОткрытиеРазделаСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОткрытиеРазделаСчетаДепо</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРазделаСчетаДепо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРазделаСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРазделСчетаДепо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСубклиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субклиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазделаСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/РазделыСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РазделыСчетаДепо</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СчетаДепо</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерПоручения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийКодНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОткрытияСчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазделаСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСубклиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субклиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЗакрытияРаздела</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПоПредписаниюБР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ОткрытиеРазделаСчетаДепо/Forms/ФормаДокумента/Ext/Form/Module.bsl
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
		 
		УстановитьНомерДокументаСервер(); 
		ЗаполнитьШапкуДокументаСервер();
		
		Если ТипЗнч(Объект.СчетДепо) = Тип("СправочникСсылка.СчетаДепо") Тогда
			Объект.РазделСчетаДепо = Справочники.РазделыСчетаДепо.ПустаяСсылка();
		ИначеЕсли ТипЗнч(Объект.СчетДепо) = Тип("СправочникСсылка.СчетаДепоМХ") Тогда
			Объект.РазделСчетаДепо = Справочники.РазделыСчетаДепоМХ.ПустаяСсылка();
		КонецЕсли;

				
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.РазделСчетаДепо) Тогда 
		БлокировкаДокумента();
    КонецЕсли;
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	БлокировкаДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьСубклиента(ЭтаФорма);
	ОбновлениеОтображения(ЭтаФорма);
	
КонецПроцедуры


//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазделСубклиентаПриИзменении(Элемент)

	УстановитьДоступностьСубклиента(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СчетДепоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ТипЗнч(Объект.ВладелецСчета) = Тип("СправочникСсылка.Организации") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.СчетаДепоМХ.ФормаВыбора", , Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоПриИзменении(Элемент)
	УстановитьДоступностьСубклиента(ЭтаФорма);
	ОбновлениеОтображения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СчетДепоПриИзменении(Элемент)
	УстановитьДоступностьСубклиента(ЭтаФорма);
	ОбновлениеОтображения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецСчетаПриИзменении(Элемент)
	ДоступныеТипы = Новый Массив;
	Если ТипЗнч(Объект.ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
		ДоступныеТипы.Добавить(Тип("СправочникСсылка.СчетаДепо"));
	ИначеЕсли ТипЗнч(Объект.ВладелецСчета) = Тип("СправочникСсылка.МестаХранения") Тогда
		ДоступныеТипы.Добавить(Тип("СправочникСсылка.СчетаДепоМХ"));
	КонецЕсли;
	Элементы.СчетДепо.ОграничениеТипа = Новый ОписаниеТипов(ДоступныеТипы);
КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоМХНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСДиалогамиКлиент.РазделСчетаДепоМХНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоМХАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = РаботаСДиалогамиКлиент.ДанныеВыбораСУчетомТипаРаздела(
	Объект.ТипРазделаСчетаДЕПО, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипРазделаСчетаДЕПОПриИзменении(Элемент)
	
	РаботаСДиалогамиКлиент.ТипРазделаСчетаДЕПОПриИзменении(Элемент, ЭтотОбъект);
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьШапкуДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ТекущийОбъект, ПараметрыСеанса.ТекущийПользователь, , );
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура УстановитьНомерДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Дата) Тогда
		ТекущийОбъект.Дата = НачалоДня(ТекущаяДата());
	КонецЕсли;
	ТекущийОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура БлокировкаДокумента()
	Если Объект.Проведен Тогда

	КонецЕсли;
КонецПроцедуры // БлокировкаДокумента()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСубклиента(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если ТипЗнч(Объект.СчетДепо) = Тип("СправочникСсылка.СчетаДепо") Тогда
		
		Элементы.РазделСубклиента.Доступность = ТипыСчетаНоминальногоДержателя(ЗначениеРеквизитаНаСервере(Объект.СчетДепо,"ТипСчетаДепо")) <> Неопределено;
	Иначе                                       
		Элементы.РазделСубклиента.Доступность = Ложь;
	КонецЕсли;
	Элементы.Субклиент.Доступность = Объект.РазделСубклиента И Элементы.РазделСубклиента.Доступность;
	Элементы.Субклиент.ОтметкаНезаполненного = Объект.РазделСубклиента;
	Элементы.Субклиент.АвтоОтметкаНезаполненного = Объект.РазделСубклиента;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипыСчетаНоминальногоДержателя(ТипСчетаДепо)
	
	ТипыСчетаНоминальногоДержателя = Перечисления.ТипыСчетовДепо.НоминальныхДержателей();
	Возврат ТипыСчетаНоминальногоДержателя.Найти(ТипСчетаДепо) <> Неопределено;
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Процедура ОбновлениеОтображения(Форма)
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если ЗначениеЗаполнено(Объект.РазделСчетаДепо)
		 И ( ТипЗнч(Объект.РазделСчетаДепо) = Тип("СправочникСсылка.РазделыСчетаДепоМХ")
		 	 ИЛИ ТипЗнч(Объект.РазделСчетаДепо) = Тип("СправочникСсылка.РазделыСчетаДепо") ) Тогда
		Элементы.НадписьКодаРазделаСчетаДепо.Заголовок = ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепо,"Код");
		
	Иначе
		Элементы.НадписьКодаРазделаСчетаДепо.Заголовок = "";
	КонецЕсли;
	
	Элементы.РазделСчетаДепоМХ.Видимость = ЗначениеЗаполнено(Объект.СчетДепо) И ТипЗнч(Объект.СчетДепо) = Тип("СправочникСсылка.СчетаДепо");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаНаСервере(Источник, ИмяРеквизита)
	Перем Результат;
	Если Источник <> Неопределено Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, ИмяРеквизита);
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции



//#КонецОбласти
